import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '西岑站',
    下行: '144.2,64.2',
    上行: '144,139.5',
    结束站点: '',
  },
  {
    起始站点: '东方绿舟站',
    结束站点: '西岑站',
    下行: '528, 64.2',
    上行: '528,139.5',
  },
  {
    起始站点: '朱家角站',
    结束站点: '东方绿舟站',
    下行: '654.1,79.3',
    上行: '626.3,124.5',
  },
  {
    起始站点: '朱家角站',
    结束站点: '东方绿舟站',
    下行: '929,79.3',
    上行: '929,124.5',
  },
  {
    起始站点: '淀山湖大道站',
    结束站点: '朱家角站',
    下行: '166.5,272',
    上行: '166.5,317.3',
  },
  {
    起始站点: '淀山湖大道站',
    结束站点: '朱家角站',
    下行: '297,272',
    上行: '297,317.3',
  },
  {
    起始站点: '汇金路站',
    结束站点: '青浦新城站',
    下行: '925.7,272',
    上行: '925.7,317.3',
  },
  {
    起始站点: '赵巷站',
    结束站点: '汇金路站',
    下行: '1093.3,272',
    上行: '1093.3, 317.3',
  },
  {
    起始站点: '嘉松中路站',
    结束站点: '赵巷站',
    下行: '261.9,450.6',
    上行: '289.6,495.8',
  },
  {
    起始站点: '徐盈路站',
    结束站点: '徐泾北城站',
    下行: '763.1,450.6',
    上行: '763.1,495.8',
  },
  {
    起始站点: '国家会展中心站',
    结束站点: '蟠龙路站',
    下行: '318.5,629.2',
    上行: '346.9,674.4',
  },
  {
    起始站点: '虹桥火车站站',
    结束站点: '国家会展中心站',
    下行: '657.5,629.2',
    上行: '629.6,674.4',
  },
  {
    起始站点: '',
    结束站点: '虹桥火车站站',
    下行: '781.2,629.2',
    上行: '831.5,674.4',
  },
  {
    起始站点: '',
    结束站点: '虹桥火车站站',
    下行: '831.5,629.2',
    上行: '781.2,674.4',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
