import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '上海南站站',
    下行: '101.6,90.4',
    上行: '124,130.3',
    结束站点: '',
  },
  {
    起始站点: '上海南站站',
    下行: '182.3,90.4',
    上行: '160,130.3',
    结束站点: '',
  },
  {
    起始站点: '石龙路站',
    下行: '445.9,90.4',
    上行: '423.6,130.3',
    结束站点: '上海南站站',
  },
  {
    起始站点: '虹桥路站',
    下行: '897.4,90.4',
    上行: '869.8,130.3',
    结束站点: '宜山路站',
  },
  {
    起始站点: '中山公园站',
    下行: '285.7,312',
    上行: '285.7,402',
    结束站点: '延安西路站',
  },
  {
    起始站点: '上海火车站站',
    下行: '801.3,337',
    上行: '783.9,377',
    结束站点: '中潭路站',
  },
  {
    起始站点: '上海火车站站',
    下行: '998.9,337',
    上行: '998.9,377',
    结束站点: '中潭路站',
  },
  {
    起始站点: '虹口足球场站',
    下行: '344.7,600.6',
    上行: '322.3,640.6',
    结束站点: '东宝兴路站',
  },
  {
    起始站点: '殷高西路站',
    下行: '729.6,600.6',
    上行: '707.2,640.6',
    结束站点: '江湾镇站',
  },
  {
    起始站点: '淞发路站',
    下行: '959.2,600.6',
    上行: '1007.3,640.6',
    结束站点: '长江南路站',
  },
  {
    起始站点: '淞发路站',
    下行: '1007.3,600.6',
    上行: '959.2,640.6',
    结束站点: '长江南路站',
  },
  {
    起始站点: '宝杨路站',
    下行: '339.5,858.6',
    上行: '373.3,898.5',
    结束站点: '水产路站',
  },
  {
    起始站点: '江杨北路站',
    下行: '892.9,858.6',
    上行: '844.9,898.5',
    结束站点: '铁力路站',
  },
  {
    起始站点: '江杨北路站',
    下行: '947,858.6',
    上行: '995,898.5',
    结束站点: '铁力路站',
  },
  {
    起始站点: '江杨北路站',
    下行: '994.8,858.6',
    上行: '946.8,898.5',
    结束站点: '铁力路站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
