import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '航头站',
    下行: '141.2,34.9',
    上行: '140.9,124',
    结束站点: '',
  },
  {
    起始站点: '下沙站',
    下行: '305.1,53.6',
    上行: '264.7,104.9',
    结束站点: '航头站',
  },
  {
    起始站点: '沈梅路站',
    下行: '560.9,53.6',
    上行: '600.6,104.9',
    结束站点: '鹤涛路站',
  },
  {
    起始站点: '沈梅路站',
    下行: '913.7,34.9',
    上行: '913.8,124',
    结束站点: '鹤涛路站',
  },
  {
    起始站点: '康桥站',
    下行: '384.8,304.1',
    上行: '384.5,393.2',
    结束站点: '周浦站',
  },
  {
    起始站点: '康桥站',
    下行: '254.2,304.1',
    上行: '254.2,393.2',
    结束站点: '周浦站',
  },
  {
    起始站点: '莲溪路站',
    下行: '686.8,327.3',
    上行: '723.7,374.2',
    结束站点: '御桥站',
  },
  {
    起始站点: '龙阳路站',
    下行: '183.7,515.4',
    上行: '183,600.6',
    结束站点: '芳芯路站',
  },
  {
    起始站点: '龙阳路站',
    下行: '54.7,515.4',
    上行: '54.7,600.6',
    结束站点: '芳芯路站',
  },
  {
    起始站点: '昌邑路站',
    下行: '617.8,534.1',
    上行: '581.3,581.6',
    结束站点: '民生路站',
  },
  {
    起始站点: '平凉路站',
    下行: '950.2,526.7',
    上行: '937.4,588.4',
    结束站点: '丹阳路站',
  },
  {
    起始站点: '江浦公园站',
    下行: '1072,526.7',
    上行: '1072.1,588.4',
    结束站点: '平凉路站',
  },
  {
    起始站点: '江浦路站',
    下行: '105.4,751.7',
    上行: '136.5,799.9',
    结束站点: '江浦公园站',
  },
  {
    起始站点: '殷高路站',
    下行: '528.1,751.7',
    上行: '498,799.9',
    结束站点: '上海财经大学站',
  },
  {
    起始站点: '',
    下行: '753.5,735.9',
    上行: '756.1,815.6',
    结束站点: '长江南路站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
