import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  // {
  //   起始站点: '蟠祥路站',
  //   下行: '101,78.9',
  //   上行: '100.9,125',
  //   结束站点: '',
  // },
  {
    起始站点: '国家会展中心站',
    下行: '255.2,78.9',
    上行: '255.2,125',
    结束站点: '', // 结束站点: '蟠祥路站',
  },
  {
    起始站点: '淞虹路站',
    下行: '788,78.9',
    上行: '788,125',
    结束站点: '虹桥2号航站楼站',
  },
  {
    起始站点: '娄山关路站',
    下行: '1010.2,78.9',
    上行: '989.9,125',
    结束站点: '威宁路站',
  },
  {
    起始站点: '江苏路站',
    下行: '132.6,212.1',
    上行: '112.4,258.2',
    结束站点: '中山公园站',
  },
  {
    起始站点: '江苏路站',
    下行: '112.4,212.1',
    上行: '132.6,258.2',
    结束站点: '中山公园站',
  },
  {
    起始站点: '人民广场站',
    下行: '456.8,212.1',
    上行: '436.5,258.2',
    结束站点: '南京西路站',
  },
  {
    起始站点: '世纪公园站',
    下行: '902.9,212.1',
    上行: '902.9,258.2',
    结束站点: '上海科技馆站',
  },
  {
    起始站点: '张江高科站',
    下行: '83.1,399.2',
    上行: '88.6,445.3',
    结束站点: '龙阳路站',
  },
  {
    起始站点: '广兰路站',
    下行: '479,399.2',
    上行: '495.9,445.3',
    结束站点: '金科路站',
  },
  {
    起始站点: '唐镇站',
    下行: '573.1,399.2',
    上行: '606.1,445.3',
    结束站点: '广兰路站',
  },
  {
    起始站点: '创新中路站',
    下行: '888,399.2',
    上行: '888,445.3',
    结束站点: '唐镇站',
  },
  {
    起始站点: '华夏东路站',
    下行: '980.7,399.2',
    上行: '980.7,445.3',
    结束站点: '创新中路站',
  },
  {
    起始站点: '凌空路站',
    下行: '197.3,600.5',
    上行: '231.6,646.5',
    结束站点: '川沙站',
  },
  {
    起始站点: '海天三路站',
    下行: '461.1,600.5',
    上行: '449.4,646.5',
    结束站点: '远东大道站',
  },
  {
    起始站点: '海天三路站',
    下行: '797.7,600.5',
    上行: '791.4,646.5',
    结束站点: '远东大道站',
  },
  {
    起始站点: '',
    下行: '1018.5,600.5',
    上行: '1052.8,646.5',
    结束站点: '浦东1号2号航站楼站',
  },
  {
    起始站点: '',
    下行: '1052.8,600.5',
    上行: '1018.5,646.5',
    结束站点: '浦东1号2号航站楼站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
