export interface IRawLineData {
  序号: number;
  地铁线路: string;
  类型: string;
  站名?: string;
  坐标: string;
}

export interface ILineData {
  coord: number[];
  type: 'station' | 'extension';
  name?: string;
}

export function formatRowPoint(rowLineData: IRawLineData): ILineData {
  const { 坐标, 类型, 站名 } = rowLineData;
  const coord = 坐标.split(',').map((e) => parseFloat(e));
  return {
    coord,
    type: 类型 === '站点' ? 'station' : 'extension',
    name: 站名,
  };
}

export const line16raw: IRawLineData[] = [
  {
    序号: 1,
    地铁线路: '16号',
    类型: '站点',
    站名: '滴水湖',
    坐标: '30.907222,121.92964',
  },
  {
    序号: 2,
    地铁线路: '16号',
    类型: '线路',
    坐标: '30.909588,121.926946',
  },
  {
    序号: 3,
    地铁线路: '16号',
    类型: '线路',
    坐标: '30.914104,121.92178',
  },
  {
    序号: 4,
    地铁线路: '16号',
    类型: '线路',
    坐标: '30.919439,121.915511',
  },
  {
    序号: 5,
    地铁线路: '16号',
    类型: '站点',
    站名: '临港大道',
    坐标: '30.923431,121.910995',
  },
  {
    序号: 6,
    地铁线路: '16号',
    类型: '线路',
    坐标: '30.931154,121.901727',
  },
  {
    序号: 7,
    地铁线路: '16号',
    类型: '线路',
    坐标: '30.939178,121.891727',
  },
  {
    序号: 8,
    地铁线路: '16号',
    类型: '线路',
    坐标: '30.942498,121.886244',
  },
  {
    序号: 9,
    地铁线路: '16号',
    类型: '线路',
    坐标: '30.947343,121.875969',
  },
  {
    序号: 10,
    地铁线路: '16号',
    类型: '线路',
    坐标: '30.955256,121.859128',
  },
  {
    序号: 11,
    地铁线路: '16号',
    类型: '站点',
    站名: '书院',
    坐标: '30.959208,121.850741',
  },
  {
    序号: 12,
    地铁线路: '16号',
    类型: '线路',
    坐标: '30.959208,121.850741',
  },
  {
    序号: 13,
    地铁线路: '16号',
    类型: '线路',
    坐标: '30.972468,121.817965',
  },
  {
    序号: 14,
    地铁线路: '16号',
    类型: '线路',
    坐标: '30.978908,121.80193',
  },
  {
    序号: 15,
    地铁线路: '16号',
    类型: '线路',
    坐标: '30.983965,121.79617',
  },
  {
    序号: 16,
    地铁线路: '16号',
    类型: '线路',
    坐标: '30.990285,121.793036',
  },
  {
    序号: 17,
    地铁线路: '16号',
    类型: '站点',
    站名: '惠南',
    坐标: '31.026424,121.793878',
  },
  {
    序号: 18,
    地铁线路: '16号',
    类型: '线路',
    坐标: '31.045661,121.793023',
  },
  {
    序号: 19,
    地铁线路: '16号',
    类型: '线路',
    坐标: '31.048286,121.792119',
  },
  {
    序号: 20,
    地铁线路: '16号',
    类型: '线路',
    坐标: '31.050734,121.79',
  },
  {
    序号: 21,
    地铁线路: '16号',
    类型: '线路',
    坐标: '31.052234,121.787557',
  },
  {
    序号: 22,
    地铁线路: '16号',
    类型: '线路',
    坐标: '31.052787,121.785622',
  },
  {
    序号: 23,
    地铁线路: '16号',
    类型: '线路',
    坐标: '31.053497,121.776959',
  },
  {
    序号: 24,
    地铁线路: '16号',
    类型: '站点',
    站名: '惠南东',
    坐标: '31.053497,121.776959',
  },
  {
    序号: 25,
    地铁线路: '16号',
    类型: '线路',
    坐标: '31.05276,121.736443',
  },
  {
    序号: 26,
    地铁线路: '16号',
    类型: '线路',
    坐标: '31.052286,121.734923',
  },
  {
    序号: 27,
    地铁线路: '16号',
    类型: '线路',
    坐标: '31.052286,121.734923',
  },
  {
    序号: 28,
    地铁线路: '16号',
    类型: '线路',
    坐标: '31.049523,121.73119',
  },
  {
    序号: 29,
    地铁线路: '16号',
    类型: '线路',
    坐标: '31.049207,121.729716',
  },
  {
    序号: 30,
    地铁线路: '16号',
    类型: '站点',
    站名: '野生动物园',
    坐标: '31.050314,121.699176',
  },
];
