import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '金运路站',
    下行: '129.7,66',
    上行: '129.7,136.7',
    结束站点: '',
  },
  {
    起始站点: '丰庄站',
    下行: '490.1,81.2',
    上行: '515,121.5',
    结束站点: '金沙江西路站',
  },
  {
    起始站点: '丰庄站',
    下行: '305.9,81.2',
    上行: '321.4,121.5',
    结束站点: '金沙江西路站',
  },
  {
    起始站点: '大渡河路站',
    下行: '834.8,71',
    上行: '834.8,131.6',
    结束站点: '真北路站',
  },
  {
    起始站点: '金沙江路站',
    下行: '940.7,71',
    上行: '940.7,131.6',
    结束站点: '大渡河路站',
  },
  {
    起始站点: '江宁路站',
    下行: '284.2,336.3',
    上行: '316.1,376.7',
    结束站点: '长寿路站',
  },
  {
    起始站点: '南京西路站',
    下行: '682.6,326.2',
    上行: '682.6,386.8',
    结束站点: '自然博物馆站',
  },
  {
    起始站点: '淮海中路站',
    下行: '794.1,326.2',
    上行: '794.1,386.8',
    结束站点: '南京西路站',
  },
  {
    起始站点: '世博大道站',
    下行: '213.8,510.6',
    上行: '197.5,571.2',
    结束站点: '世博会博物馆站',
  },
  {
    起始站点: '长清路站',
    下行: '341.8,510.6',
    上行: '354.2,571.2',
    结束站点: '世博大道站',
  },
  {
    起始站点: '下南路站',
    下行: '1008.3,510.6',
    上行: '1008.3,571.2',
    结束站点: '华鹏路站',
  },
  {
    起始站点: '下南路站',
    下行: '884.3,510.6',
    上行: '884.3,571.2',
    结束站点: '华鹏路站',
  },
  {
    起始站点: '陈春路站',
    下行: '313.9,688.1',
    上行: '281.5,728.5',
    结束站点: '北蔡站',
  },
  {
    起始站点: '华夏中路站',
    下行: '577,678',
    上行: '559.4,738.6',
    结束站点: '莲溪路站',
  },
  {
    起始站点: '中科路站',
    下行: '911.4,678',
    上行: '927.3,738.6',
    结束站点: '华夏中路站',
  },
  {
    起始站点: '',
    下行: '147,843.1',
    上行: '147,913.8',
    结束站点: '张江路站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
