import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '港城路站',
    下行: '378.1,100.9',
    上行: '263.1,155.3',
    结束站点: '',
  },
  {
    起始站点: '港城路站',
    下行: '248.1,100.9',
    上行: '384.6,128.1',
    结束站点: '',
  },
  {
    起始站点: '外高桥保税区南站',
    下行: '711.1,100.9',
    上行: '736.7,128.1',
    结束站点: '航津路站',
  },
  {
    起始站点: '五洲大道站',
    下行: '1021,100.9',
    上行: '1046.6,128.1',
    结束站点: '洲海路站',
  },
  {
    起始站点: '巨峰路站',
    下行: '293.5,268.6',
    上行: '176.1,334.6',
    结束站点: '东靖路站',
  },
  {
    起始站点: '巨峰路站',
    下行: '176.1,268.6',
    上行: '293.5,334.6',
    结束站点: '东靖路站',
  },
  {
    起始站点: '云山路站',
    下行: '811.3,288',
    上行: '785.7,315.2',
    结束站点: '金桥路站',
  },
  {
    起始站点: '民生路站',
    下行: '82,447.3',
    上行: '101.5,501.7',
    结束站点: '北洋泾路站',
  },
  {
    起始站点: '源深体育中心站',
    下行: '222.1,447.3',
    上行: '240.8,501.7',
    结束站点: '民生路站',
  },
  {
    起始站点: '临沂新村站',
    下行: '883.5,447.3',
    上行: '875,501.7',
    结束站点: '上海儿童医学中心站',
  },
  {
    起始站点: '华夏西路站',
    下行: '269.6,676.9',
    上行: '261.8,731.3',
    结束站点: '高青路站',
  },
  {
    起始站点: '',
    下行: '966.2,690.5',
    上行: '992.3,717.7',
    结束站点: '东方体育中心站',
  },
  {
    起始站点: '',
    下行: '991.7,690.5',
    上行: '965.6,717.7',
    结束站点: '东方体育中心站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
