import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '华夏中路站',
    下行: '243.5,151.5',
    上行: '207.3,188',
    结束站点: '龙阳路站',
  },
  {
    起始站点: '华夏中路站',
    下行: '207.3,151.5',
    上行: '243.5,188',
    结束站点: '龙阳路站',
  },
  {
    起始站点: '周浦东站',
    下行: '1021.6,151.5',
    上行: '984.7,188',
    结束站点: '罗山路站',
  },
  {
    起始站点: '航头东站',
    下行: '292.4,364.1',
    上行: '314.6,400.6',
    结束站点: '鹤沙航城站',
  },
  {
    起始站点: '新场站',
    下行: '594.2,364.1',
    上行: '573.4,400.6',
    结束站点: '航头东站',
  },
  {
    起始站点: '惠南站',
    下行: '309,573.7',
    上行: '327.5,610.6',
    结束站点: '野生动物园站',
  },
  {
    起始站点: '惠南站',
    下行: '44.9,573.7',
    上行: '66,610.6',
    结束站点: '野生动物园站',
  },
  {
    起始站点: '惠南东站',
    下行: '610.5,573.7',
    上行: '579.3,610.6',
    结束站点: '惠南站',
  },
  {
    起始站点: '惠南东站',
    下行: '579.3,573.7',
    上行: '610.5,610.6',
    结束站点: '惠南站',
  },
  {
    起始站点: '书院站',
    下行: '163.7,842.1',
    上行: '144.1,926.6',
    结束站点: '惠南东站',
  },
  {
    起始站点: '临港大道站',
    下行: '315.2,842.1',
    上行: '344.4,926.6',
    结束站点: '书院站',
  },
  {
    起始站点: '临港大道站',
    下行: '627.1,866.2',
    上行: '590,902.5',
    结束站点: '书院站',
  },
  {
    起始站点: '滴水湖站',
    下行: '920.7,866.2',
    上行: '883.9,902.5',
    结束站点: '临港大道站',
  },
  {
    起始站点: '滴水湖站',
    下行: '884.1,866.2',
    上行: '920.8,902.5',
    结束站点: '临港大道站',
  },
  {
    起始站点: '滴水湖站',
    下行: '718.8,866.2',
    上行: '756.1,902.5',
    结束站点: '临港大道站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
