import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '七莘路站',
    下行: '331,29',
    上行: '331,97.8',
    结束站点: '',
  },
  {
    起始站点: '虹梅路站',
    下行: '799.4,33.8',
    上行: '799.4,93',
    结束站点: '东兰路站',
  },
  {
    起始站点: '虹梅路站',
    下行: '687.3,33.8',
    上行: '687.3,93',
    结束站点: '东兰路站',
  },
  {
    起始站点: '龙华中路站',
    下行: '233.1,226.6',
    上行: '233.1,285.7',
    结束站点: '龙华站',
  },
  {
    起始站点: '大木桥路站',
    下行: '353.7,226.6',
    上行: '353.7,285.7',
    结束站点: '龙华中路站',
  },
  {
    起始站点: '天潼路站',
    下行: '967.2,239.1',
    上行: '948.5,273.2',
    结束站点: '曲阜路站',
  },
  {
    起始站点: '国际客运中心站',
    下行: '65.4,405.2',
    上行: '65.4,464.3',
    结束站点: '天潼路站',
  },
  {
    起始站点: '提篮桥站',
    下行: '184.7,405.2',
    上行: '184.7,464.3',
    结束站点: '国际客运中心站',
  },
  {
    起始站点: '隆昌路站',
    下行: '529.2,405.2',
    上行: '529.2,464.3',
    结束站点: '宁国路站',
  },
  {
    起始站点: '爱国路站',
    下行: '617.5,405.2',
    上行: '617.5,464.3',
    结束站点: '隆昌路站',
  },
  {
    起始站点: '杨高北路站',
    下行: '1050.5,405.2',
    上行: '1050.5,464.3',
    结束站点: '巨峰路站',
  },
  {
    起始站点: '杨高北路站',
    下行: '972,405.2',
    上行: '966,464.3',
    结束站点: '巨峰路站',
  },
  {
    起始站点: '',
    下行: '404.7,599.2',
    上行: '385.7,633.2',
    结束站点: '金海路站',
  },
  {
    起始站点: '',
    下行: '385,599.2',
    上行: '404,633.2',
    结束站点: '金海路站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
