import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '紫竹高新区站',
    下行: '161,29.3',
    上行: '161,101.5',
    结束站点: '',
  },
  {
    起始站点: '永德路站',
    下行: '263.5,41.4',
    上行: '232.8,89.4',
    结束站点: '紫竹高新区站',
  },
  {
    起始站点: '双柏路站',
    下行: '880.3,29.3',
    上行: '880.3,101.5',
    结束站点: '元江路站',
  },
  {
    起始站点: '双柏路站',
    下行: '576.6,41.4',
    上行: '607.7,89.4',
    结束站点: '元江路站',
  },
  {
    起始站点: '虹梅南路站',
    下行: '118.4,245.5',
    上行: '149.9,293.5',
    结束站点: '景西路站',
  },
  {
    起始站点: '景洪路站',
    下行: '485.3,233.4',
    上行: '485.3,305.6',
    结束站点: '虹梅南路站',
  },
  {
    起始站点: '景洪路站',
    下行: '369.7,233.4',
    上行: '369.7,305.6',
    结束站点: '虹梅南路站',
  },
  {
    起始站点: '华东理工大学站',
    下行: '779.9,245.5',
    上行: '813.8,293.5',
    结束站点: '罗秀路站',
  },
  {
    起始站点: '吴中路站',
    下行: '128.6,438.2',
    上行: '128.6,486.3',
    结束站点: '桂林路站',
  },
  {
    起始站点: '吴中路站',
    下行: '40.2,438.2',
    上行: '40.2,486.3',
    结束站点: '桂林路站',
  },
  {
    起始站点: '姚虹路站',
    下行: '283.6,438.2',
    上行: '317.5,486.3',
    结束站点: '吴中路站',
  },
  {
    起始站点: '长风公园站',
    下行: '578.6,438.2',
    上行: '578.6,486.3',
    结束站点: '娄山关路站',
  },
  {
    起始站点: '大渡河路站',
    下行: '702.6,438.2',
    上行: '702.6,486.3',
    结束站点: '长风公园站',
  },
  {
    起始站点: '梅岭北路站',
    下行: '878,438.2',
    上行: '911.8,486.3',
    结束站点: '大渡河路站',
  },
  {
    起始站点: '古浪路站',
    下行: '164.1,633.8',
    上行: '148.9,681.9',
    结束站点: '武威东路站',
  },
  {
    起始站点: '祁安路站',
    下行: '285.2,633.8',
    上行: '285.2,681.9',
    结束站点: '古浪路站',
  },
  {
    起始站点: '顾村公园站',
    下行: '929.1,633.8',
    上行: '894.9,681.9',
    结束站点: '锦秋路站',
  },
  {
    起始站点: '顾村公园站',
    下行: '703.6,621.7',
    上行: '703.6,694',
    结束站点: '锦秋路站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
