import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '市光路站',
    下行: '297.8,63.3',
    上行: '265.1,96.2',
    结束站点: '',
  },
  {
    起始站点: '市光路站',
    下行: '265.1,63.3',
    上行: '297.8,96.2',
    结束站点: '',
  },
  {
    起始站点: '延吉中路站',
    下行: '887.4,44.7',
    上行: '887.4,114.7',
    结束站点: '黄兴公园站',
  },
  {
    起始站点: '曲阳路站',
    下行: '366.3,220.4',
    上行: '383.7,290.7',
    结束站点: '四平路站',
  },
  {
    起始站点: '大世界站',
    下行: '32.5,417.6',
    上行: '65.2,450.4',
    结束站点: '人民广场站',
  },
  {
    起始站点: '西藏南路站',
    下行: '438.6,417.6',
    上行: '411.4,450.4',
    结束站点: '陆家浜路站',
  },
  {
    起始站点: '耀华路站',
    下行: '736,399',
    上行: '689,468.9',
    结束站点: '中华艺术宫站',
  },
  {
    起始站点: '成山路站',
    下行: '911.3,399',
    上行: '878.2,468.9',
    结束站点: '耀华路站',
  },
  {
    起始站点: '凌兆新村站',
    下行: '203.5,569.1',
    上行: '203.5,639.1',
    结束站点: '东方体育中心站',
  },
  {
    起始站点: '浦江镇站',
    下行: '623,587.7',
    上行: '641.5,620.5',
    结束站点: '芦恒路站',
  },
  {
    起始站点: '沈杜公路站',
    下行: '83,727.9',
    上行: '38.4,797.9',
    结束站点: '联航路站',
  },
  {
    起始站点: '',
    下行: '162.7,727.9',
    上行: '162.7,797.9',
    结束站点: '沈杜公路站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
