import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '罗南新村站',
    下行: '166,95.3',
    上行: '138.6,130.6',
    结束站点: '美兰湖站',
  },
  {
    起始站点: '罗南新村站',
    下行: '139.7,95.3',
    上行: '167.4,130.6',
    结束站点: '美兰湖站',
  },
  {
    起始站点: '刘行路站',
    下行: '474.8,95.3',
    上行: '499,130.6',
    结束站点: '潘广路站',
  },
  {
    起始站点: '',
    下行: '1110.3,68.6',
    上行: '1109.1,158.8',
    结束站点: '顾村公园站',
  },
  {
    起始站点: '场中路站',
    下行: '529.3,286.9',
    上行: '527.5,348.7',
    结束站点: '上大路站',
  },
  {
    起始站点: '大华三路站',
    下行: '859.9,315.3',
    上行: '830.3,348.7',
    结束站点: '行知路站',
  },
  {
    起始站点: '镇坪路站',
    下行: '75.7,528',
    上行: '103.8,561.1',
    结束站点: '岚皋路站',
  },
  {
    起始站点: '昌平路站',
    下行: '451.9,503',
    上行: '437.9,585.7',
    结束站点: '长寿路站',
  },
  {
    起始站点: '静安寺站',
    下行: '578.7,503',
    上行: '437.9,585.7',
    结束站点: '昌平路站',
  },
  {
    起始站点: '后滩站',
    下行: '107.7,732.4',
    上行: '107.2,821.3',
    结束站点: '龙华中路站',
  },
  {
    起始站点: '高科西路站',
    下行: '681.1,759',
    上行: '710.3,794.8',
    结束站点: '云台路站',
  },
  {
    起始站点: '杨高南路站',
    下行: '964.3,759',
    上行: '986.2,821.3',
    结束站点: '高科西路站',
  },
  {
    起始站点: '花木路站',
    下行: '506.8,972.3',
    上行: '476.9,1007.4',
    结束站点: '龙阳路站',
  },
  {
    起始站点: '花木路站',
    下行: '478.5,972.3',
    上行: '508,1007.4',
    结束站点: '龙阳路站',
  },
  {
    起始站点: '花木路站',
    下行: '330.4,945',
    上行: '315,1035.6',
    结束站点: '龙阳路站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
