import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '虹桥路站',
    下行: '105,44.7',
    上行: '115.7,89.6',
    结束站点: '宜山路站',
  },
  {
    起始站点: '中山公园站',
    下行: '591.9,44.7',
    上行: '591.9,89.6',
    结束站点: '延安西路站',
  },
  {
    起始站点: '',
    下行: '995.3,44.7',
    上行: '979,89.6',
    结束站点: '中潭路站',
  },
  {
    起始站点: '上海火车站站',
    下行: '74.9,197.7',
    上行: '74.8,242.7',
    结束站点: '',
  },
  {
    起始站点: '大连路站',
    下行: '738.7,197.7',
    上行: '752.2,242.7',
    结束站点: '临平路站',
  },
  {
    起始站点: '杨树浦路站',
    下行: '936.3,197.7',
    上行: '914.2,242.7',
    结束站点: '大连路站',
  },
  {
    起始站点: '蓝村路站',
    下行: '273.8,376.3',
    上行: '251.7,421.3',
    结束站点: '向城路站',
  },
  {
    起始站点: '',
    下行: '1025.3,376.3',
    上行: '1003.2,421.2',
    结束站点: '大木桥路站',
  },
  {
    起始站点: '',
    下行: '380.2,569.1',
    上行: '380.2,614',
    结束站点: '上海体育馆站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
