import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '松江南站',
    下行: '94,80.3',
    上行: '94,147.6',
    结束站点: '',
  },
  {
    起始站点: '松江新城站',
    下行: '383.5,80.3',
    上行: '382,147.6',
    结束站点: '松江体育中心站',
  },
  {
    起始站点: '松江新城站',
    下行: '293.4,80.3',
    上行: '293.4,147.6',
    结束站点: '松江体育中心站',
  },
  {
    起始站点: '松江大学城站',
    下行: '465.7,80.3',
    上行: '441.6,125.1',
    结束站点: '松江新城站',
  },
  {
    起始站点: '松江大学城站',
    下行: '441.6,80.3',
    上行: '465.7,125.1',
    结束站点: '松江新城站',
  },
  {
    起始站点: '佘山站',
    下行: '902.6,80.3',
    上行: '778,136.4',
    结束站点: '洞泾站',
  },
  {
    起始站点: '佘山站',
    下行: '790.3,80.3',
    上行: '919.2,136.4',
    结束站点: '洞泾站',
  },
  {
    起始站点: '中春路站',
    下行: '448.8,309.9',
    上行: '464.6,354.7',
    结束站点: '九亭站',
  },
  {
    起始站点: '中春路站',
    下行: '261.9,309.9',
    上行: '276.8,354.7',
    结束站点: '九亭站',
  },
  {
    起始站点: '桂林路站',
    下行: '43.1,485.7',
    上行: '59.5,541.6',
    结束站点: '漕河泾开发区站',
  },
  {
    起始站点: '宜山路站',
    下行: '325.4,485.7',
    上行: '352.1,530.4',
    结束站点: '桂林路站',
  },
  {
    起始站点: '陆家浜路站',
    下行: '971.6,485.7',
    上行: '985.1,530.4',
    结束站点: '马当路站',
  },
  {
    起始站点: '世纪大道站',
    下行: '221.8,681.2',
    上行: '247.8,725.9',
    结束站点: '商城路站',
  },
  {
    起始站点: '芳甸路站',
    下行: '650.3,658.7',
    上行: '523.4,748.4',
    结束站点: '杨高中路站',
  },
  {
    起始站点: '芳甸路站',
    下行: '523.4,658.7',
    上行: '650.3,748.4',
    结束站点: '杨高中路站',
  },
  {
    起始站点: '金海路站',
    下行: '290.3,854.4',
    上行: '290.5,944.1',
    结束站点: '金吉路站',
  },
  {
    起始站点: '曹路站',
    下行: '745.5,854.4',
    上行: '694.7,944.1',
    结束站点: '民雷路站',
  },
  {
    起始站点: '曹路站',
    下行: '694.7,854.4',
    上行: '745.5,944.1',
    结束站点: '民雷路站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
