import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '封浜站',
    下行: '349.5,35.8',
    上行: '350.6,103.3',
    结束站点: '',
  },
  {
    起始站点: '乐秀路站',
    下行: '488.5,54.4',
    上行: '457.8,84.2',
    结束站点: '封浜站',
  },
  {
    起始站点: '嘉怡路站',
    下行: '649.7,54.4',
    上行: '679.8,84.2',
    结束站点: '临洮路站',
  },
  {
    起始站点: '真新新村站',
    下行: '982,41',
    上行: '982,96.9',
    结束站点: '定边路站',
  },
  {
    起始站点: '真新新村站',
    下行: '865.6,41',
    上行: '866.1,96.9',
    结束站点: '定边路站',
  },
  {
    起始站点: '真如站',
    下行: '214.8,199',
    上行: '185,228.7',
    结束站点: '铜川路站',
  },
  {
    起始站点: '曹杨路站',
    下行: '403.8,187.6',
    上行: '423.9,240.9',
    结束站点: '中宁路站',
  },
  {
    起始站点: '武宁路站',
    下行: '569.8,187.6',
    上行: '550.4,240.9',
    结束站点: '曹杨路站',
  },
  {
    起始站点: '一大会址·黄陂南路站',
    下行: '935.9,187.6',
    上行: '935.9,240.9',
    结束站点: '静安寺站',
  },
  {
    起始站点: '大世界站',
    下行: '1093.5,187.6',
    上行: '1093.5,240.9',
    结束站点: '一大会址·黄陂南路站',
  },
  {
    起始站点: '源深路站',
    下行: '484.8,357.4',
    上行: '484.8,411.2',
    结束站点: '浦东大道站',
  },
  {
    起始站点: '昌邑路站',
    下行: '667,357.4',
    上行: '667,411.2',
    结束站点: '源深路站',
  },
  {
    起始站点: '云山路站',
    下行: '868.6,367.4',
    上行: '896.1,394.9',
    结束站点: '歇浦路站',
  },
  {
    起始站点: '黄杨路站',
    下行: '194.9,539',
    上行: '194.9,591.9',
    结束站点: '蓝天路站',
  },
  {
    起始站点: '黄杨路站',
    下行: '68,539',
    上行: '68,591.9',
    结束站点: '蓝天路站',
  },
  {
    起始站点: '浦东足球场站',
    下行: '415.5,551.7',
    上行: '443.3,579.2',
    结束站点: '云顺路站',
  },
  {
    起始站点: '桂桥路站',
    下行: '669.3,551.7',
    上行: '641.8,579.2',
    结束站点: '金粤路站',
  },
  {
    起始站点: '',
    下行: '768.5,533.8',
    上行: '768.5,597.1',
    结束站点: '桂桥路站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
