import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '虹桥火车站站',
    下行: '146,51.8',
    上行: '145.5,124.8',
    结束站点: '',
  },
  {
    起始站点: '虹桥2号航站楼站',
    下行: '255.3,65.6',
    上行: '210.2,111',
    结束站点: '虹桥火车站站',
  },
  {
    起始站点: '水城路站',
    下行: '700.2,59.5',
    上行: '678.7,117.1',
    结束站点: '龙溪路站',
  },
  {
    起始站点: '宋园路站',
    下行: '964.9,58.7',
    上行: '964.9,117.9',
    结束站点: '伊犁路站',
  },
  {
    起始站点: '虹桥路站',
    下行: '1054.6,58.7',
    上行: '1054.6,117.9',
    结束站点: '宋园路站',
  },
  {
    起始站点: '紫藤路站',
    下行: '103.5,218.2',
    上行: '85.3,257.2',
    结束站点: '航中路站',
  },
  {
    起始站点: '紫藤路站',
    下行: '85.3,218.2',
    上行: '103.5,257.2',
    结束站点: '航中路站',
  },
  {
    起始站点: '龙柏新村站',
    下行: '393.7,194.6',
    上行: '393.7,280.7',
    结束站点: '紫藤路站',
  },
  {
    起始站点: '新天地站',
    下行: '518.7,347.9',
    上行: '519.8,415.4',
    结束站点: '陕西南路站',
  },
  {
    起始站点: '老西门站',
    下行: '639.8,347.9',
    上行: '640.7,415.4',
    结束站点: '新天地站',
  },
  {
    起始站点: '四川北路站',
    下行: '64.6,527.5',
    上行: '65.7,599.1',
    结束站点: '天潼路站',
  },
  {
    起始站点: '海伦路站',
    下行: '190.3,527.5',
    上行: '190.3,599.1',
    结束站点: '四川北路站',
  },
  {
    起始站点: '同济大学站',
    下行: '556.5,536.5',
    上行: '536,584.5',
    结束站点: '四平路站',
  },
  {
    起始站点: '三门路站',
    下行: '903,528.3',
    上行: '823.2,592.7',
    结束站点: '江湾体育场站',
  },
  {
    起始站点: '三门路站',
    下行: '823.2,528.3',
    上行: '902.8,592.7',
    结束站点: '江湾体育场站',
  },
  {
    起始站点: '新江湾城站',
    下行: '82.5,738.1',
    上行: '88.8,802.5',
    结束站点: '殷高东路站',
  },
  {
    起始站点: '高桥西站',
    下行: '459.6,746.3',
    上行: '479.2,794.3',
    结束站点: '双江路站',
  },
  {
    起始站点: '高桥站',
    下行: '631.9,746.3',
    上行: '610.5,794.3',
    结束站点: '高桥西站',
  },
  {
    起始站点: '高桥站',
    下行: '610.5,746.3',
    上行: '631.9,794.3',
    结束站点: '高桥西站',
  },
  {
    起始站点: '基隆路站',
    下行: '1025.7,746.3',
    上行: '1005.5,794.3',
    结束站点: '港城路站',
  },
  {
    起始站点: '',
    下行: '1100,746.3',
    上行: '1080,794.3',
    结束站点: '基隆路站',
  },
  {
    起始站点: '',
    下行: '1068.2,746.3',
    上行: '1089.1,794.3',
    结束站点: '基隆路站',
  },
  // 支线拐点
  {
    起始站点: '龙溪路站',
    下行: '601.4,59.5',
    上行: '580.9,117.1',
    结束站点: '上海动物园站',
    支线站点: ['龙柏新村站'],
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
