import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '花桥站',
    下行: '77.2,99.2',
    上行: '65.8,129.1',
    结束站点: '',
  },
  {
    起始站点: '花桥站',
    下行: '65.8,99.2',
    上行: '77.2,129.1',
    结束站点: '',
  },
  {
    起始站点: '光明路站',
    下行: '126,99.2',
    上行: '137.3,129.1',
    结束站点: '花桥站',
  },
  {
    起始站点: '兆丰路站',
    下行: '272.2,99.2',
    上行: '264.6,129.1',
    结束站点: '光明路站',
  },
  {
    起始站点: '安亭站',
    下行: '419.5,91.4',
    上行: '428.7,136.9',
    结束站点: '兆丰路站',
  },
  {
    起始站点: '安亭站',
    下行: '371,91.4',
    上行: '379.5,136.9',
    结束站点: '兆丰路站',
  },
  {
    起始站点: '安亭站',
    下行: '310.6,99.2',
    上行: '303,129.1',
    结束站点: '兆丰路站',
  },
  {
    起始站点: '上海汽车城站',
    下行: '472.4,99.2',
    上行: '460.8,129.1',
    结束站点: '安亭站',
  },
  {
    起始站点: '上海汽车城站',
    下行: '460.84,99.2',
    上行: '472.4,129.1',
    结束站点: '安亭站',
  },
  {
    起始站点: '昌吉东路站',
    下行: '573.6,99.2',
    上行: '562,129.1',
    结束站点: '上海汽车城站',
  },
  {
    起始站点: '上海赛车场站',
    下行: '775.6,99.2',
    上行: '764,129.1',
    结束站点: '昌吉东路站',
  },
  {
    起始站点: '上海赛车场站',
    下行: '764,99.2',
    上行: '775.6,129.1',
    结束站点: '昌吉东路站',
  },
  {
    起始站点: '嘉定新城站',
    下行: '880,81.8',
    上行: '853.7,146.6',
    结束站点: '上海赛车场站',
  },
  {
    起始站点: '嘉定新城站',
    下行: '851.2,81.8',
    上行: '877.6,146.6',
    结束站点: '上海赛车场站',
  },
  {
    起始站点: '马陆站',
    下行: '107,357.2',
    上行: '120.3,387.1',
    结束站点: '嘉定新城站',
  },
  {
    起始站点: '马陆站',
    下行: '1064,99.2',
    上行: '1052.4,129.1',
    结束站点: '嘉定新城站',
  },
  {
    起始站点: '马陆站',
    下行: '1052.4,99.2',
    上行: '1064,129.1',
    结束站点: '嘉定新城站',
  },
  {
    起始站点: '嘉定西站',
    下行: '727.2,199.3',
    上行: '713.6,229.3',
    结束站点: '嘉定北站',
  },
  {
    起始站点: '嘉定北站',
    下行: '661,199.3',
    上行: '647.5,229.3',
    结束站点: '',
  },
  {
    起始站点: '嘉定北站',
    下行: '647.5,199.3',
    上行: '661,229.3',
    结束站点: '',
  },
  {
    起始站点: '云锦路站',
    下行: '241.5,512.5',
    上行: '241.5,560.7',
    结束站点: '龙华站',
  },
  {
    起始站点: '龙耀路站',
    下行: '291.3,512.5',
    上行: '291.3,560.7',
    结束站点: '云锦路站',
  },
  {
    起始站点: '三林站',
    下行: '572.1,506.9',
    上行: '562,566.2',
    结束站点: '东方体育中心站',
  },
  {
    起始站点: '浦三路站',
    下行: '728,512.4',
    上行: '728,560.6',
    结束站点: '三林东站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
