import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '莘庄站',
    下行: '218,97.5',
    上行: '168.3,139.2',
    结束站点: '',
  },
  {
    起始站点: '莘庄站',
    下行: '168.3,97.5',
    上行: '218,139.2',
    结束站点: '',
  },
  {
    起始站点: '北桥站',
    下行: '518.3,97.5',
    上行: '568,139.2',
    结束站点: '颛桥站',
  },
  {
    起始站点: '剑川路站',
    下行: '994.1,97.5',
    上行: '944.5,139.2',
    结束站点: '北桥站',
  },
  {
    起始站点: '剑川路站',
    下行: '762,97.5',
    上行: '811.7,139.2',
    结束站点: '北桥站',
  },
  {
    起始站点: '东川路站',
    下行: '76.5,305',
    上行: '126.8,346.7',
    结束站点: '剑川路站',
  },
  {
    起始站点: '金平路站',
    下行: '497.5,446.2',
    上行: '447.4,473.1',
    结束站点: '东川路站',
  },
  {
    起始站点: '华宁路站',
    下行: '567.6,446.2',
    上行: '617.7,473.1',
    结束站点: '金平路站',
  },
  {
    起始站点: '',
    下行: '961.6,446.2',
    上行: '911.5,473.1',
    结束站点: '闵行开发区站',
  },
  {
    起始站点: '',
    下行: '911.5,446.2',
    上行: '961.6,473.1',
    结束站点: '闵行开发区站',
  },

  {
    起始站点: '萧塘站',
    下行: '723.1,305',
    上行: '772.1,346.7',
    结束站点: '西渡站',
  },
  {
    起始站点: '奉浦大道站',
    下行: '1030.7,305',
    上行: '878.7,346.7',
    结束站点: '萧塘站',
  },
  {
    起始站点: '奉浦大道站',
    下行: '857.5,305',
    上行: '1010.1,346.7',
    结束站点: '萧塘站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
