import { transferCorners } from '../../patrolling.utils';

export const rawCorners: PatrollingType.RawCornerCouple[] = [
  {
    起始站点: '莘庄站',
    下行: '94.6,64.8',
    上行: '141.7,112',
    结束站点: '',
  },
  {
    起始站点: '莘庄站',
    下行: '140.9,64.8',
    上行: '93.8,112',
    结束站点: '',
  },
  {
    起始站点: '外环路站',
    下行: '228.3,64.8',
    上行: '275.4,112',
    结束站点: '莘庄站',
  },
  {
    起始站点: '外环路站',
    下行: '274.5,64.8',
    上行: '227.4,112',
    结束站点: '莘庄站',
  },
  {
    起始站点: '锦江乐园站',
    下行: '549.7,64.8',
    上行: '596.8,112',
    结束站点: '莲花路站',
  },
  {
    起始站点: '锦江乐园站',
    下行: '696.5,64.8',
    上行: '649.4,112',
    结束站点: '莲花路站',
  },
  {
    起始站点: '上海南站站',
    下行: '992.8,64.8',
    上行: '992.8,112',
    结束站点: '锦江乐园站',
  },
  {
    起始站点: '徐家汇站',
    下行: '294.1,257.5',
    上行: '294.9,304.4',
    结束站点: '上海体育馆站',
  },
  {
    起始站点: '人民广场站',
    下行: '824.7,257.5',
    上行: '294.9,304.4',
    结束站点: '一大会址·黄陂南路站',
  },
  {
    起始站点: '中山北路站',
    下行: '150.4,422',
    上行: '151.5,468.9',
    结束站点: '上海火车站站',
  },
  {
    起始站点: '彭浦新村站',
    下行: '808.4,421.6',
    上行: '762,468.2',
    结束站点: '汶水路站',
  },
  {
    起始站点: '呼兰路站',
    下行: '71.5,592',
    上行: '117.9,638.2',
    结束站点: '通河新村站',
  },
  {
    起始站点: '宝安公路站',
    下行: '453.9,592',
    上行: '407.4,638.2',
    结束站点: '共富新村站',
  },
  {
    起始站点: '富锦路站',
    下行: '807.2,592',
    上行: '806.4,668.2',
    结束站点: '友谊西路站',
  },
  {
    起始站点: '',
    下行: '916.6,592',
    上行: '917.9,668.2',
    结束站点: '富锦路站',
  },
];

export const corners = transferCorners(rawCorners);
export default corners;
